config.el
(require 'package)


;; Adds the Melpa archive to the list of available repositories
(add-to-list 'package-archives
             '("melpa" . "http://melpa.org/packages/") t)

(add-to-list 'package-archives
             '("melpa-stable" . "https://stable.melpa.org/packages/") t)

;; If there are no archived package contents, refresh them
(when (not package-archive-contents)
  (package-refresh-contents))

;; install 'use-package if not installed
(unless (package-installed-p 'use-package)
  (package-install 'use-package))

(use-package monokai-theme
  :ensure t
  )

(use-package beacon
  :ensure t
  :init
  (beacon-mode 1))

(use-package rainbow-delimiters
   :ensure t
   :init
   (add-hook 'prog-mode-hook #'rainbow-delimiters-mode)
   (add-hook 'LaTeX-mode-hook #'rainbow-delimiters-mode))

; or (rainbow-delimiters-mode 1) for global mode

(use-package rainbow-mode
:ensure t
:init (rainbow-mode 1))

(use-package emojify
  :ensure t
  :hook (after-init . global-emojify-mode))

(use-package dashboard
:ensure t
:config
(dashboard-setup-startup-hook)
(setq dashboard-items '((projects . 10)
			(recents . 5)))
(setq dashboard-banner-logo-title "Hello Han."))

(use-package company
:ensure t
:init
(add-hook 'after-init-hook 'global-company-mode)) ;; global mode, do we need it

(use-package which-key
  :ensure t
  :init
  (which-key-mode))

(setq org-src-window-setup 'current-window)

(use-package org-bullets
  :ensure t
  :config
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode))))

;; (define-key org-mode-map (kbd "C-c s") 'org-insert-structure-template)

(defun org-hide-sublevels ()
  (interactive)
  (hide-sublevels 1))

(global-set-key (kbd "C-c h s") 'org-hide-sublevels)

(use-package markdown-mode
  :ensure t
  :mode ("README\\.md\\'" . gfm-mode)
  :init (setq markdown-command "multimarkdown"))

(defun my-put-file-name-on-clipboard ()
  "Put the current file name on the clipboard"
  (interactive)
  (let ((filename (if (equal major-mode 'dired-mode)
		      default-directory
		    (buffer-file-name))))
    (when filename
      (with-temp-buffer
	(insert filename)
	(clipboard-kill-region (point-min) (point-max)))
      (message filename))))

(defun onboarding-org-visit ()
"visit ~/docs/notes/onboarding.org"
(interactive)
(find-file "~/docs/notes/onboarding.org"))
(global-set-key (kbd "C-c o o") 'onboarding-org-visit)
