config.el

(defun dmrs-org-visit ()
"visit ~/docs/notes/dmrs.org"
(interactive)
(find-file "~/docs/notes/dmrs.org"))
(global-set-key (kbd "C-c o d") 'dmrs-org-visit)

(use-package switch-window

  :ensure t
  :init
  (global-set-key (kbd "C-x o") 'switch-window)
  (global-set-key (kbd "C-x 1") 'switch-window-then-maximize)
  (global-set-key (kbd "C-x 2") 'switch-window-then-split-below)
  (global-set-key (kbd "C-x 3") 'switch-window-then-split-right)
  (global-set-key (kbd "C-x 0") 'switch-window-then-delete)

  (global-set-key (kbd "C-x 4 d") 'switch-window-then-dired)
  (global-set-key (kbd "C-x 4 f") 'switch-window-then-find-file)
  (global-set-key (kbd "C-x 4 m") 'switch-window-then-compose-mail)
  (global-set-key (kbd "C-x 4 r") 'switch-window-then-find-file-read-only)

  (global-set-key (kbd "C-x 4 C-f") 'switch-window-then-find-file)
  (global-set-key (kbd "C-x 4 C-o") 'switch-window-then-display-buffer)

  (global-set-key (kbd "C-x 4 0") 'switch-window-then-kill-buffer))

  (setq switch-window-threshold 2)
  (setq switch-window-input-style 'minibuffer)
  (setq switch-window-shortcut-style 'qwerty)

(defun split-window-and-follow-vertically ()
(interactive)
(split-window-below)
(balance-windows)
(other-window 1))
(global-set-key (kbd "C-x 2") 'split-window-and-follow-vertically)

(defun split-window-and-follow-horizontally ()
(interactive)
(split-window-right)
(balance-windows)
(other-window 1))
(global-set-key (kbd "C-x 3") 'split-window-and-follow-horizontally)

(global-set-key (kbd "C-x C-b") 'ibuffer)

(setq ibuffer-expert t)

(defun kill-and-close-this-buffer ()
  (interactive)
  (kill-this-buffer)
  (delete-window))

(global-set-key (kbd "C-c k") 'kill-and-close-this-buffer)

(defun kill-all-buffers ()
(interactive)
(mapc 'kill-buffer (buffer-list)))
(global-set-key (kbd "C-M-k") 'kill-all-buffers)

(use-package projectile
  :ensure t
  :config
  (define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)
  (projectile-mode +1)
  )

(defun projectile-project-type-to-python-pip ()
  (interactive)
  (setq projectile-project-type 'python-pip)
  )
(global-set-key (kbd "C-c t p p") 'projectile-project-type-to-python-pip)

(use-package ido
  :ensure t
  :config
  (setq ido-enable-flex-matching nil
	ido-create-new-buffer 'always
	ido-everywhere t)
  (add-to-list 'ido-ignore-files "\.bak")
  (add-to-list 'ido-ignore-files "\.log")
  (add-to-list 'ido-ignore-files ".venv")
  (add-to-list 'ido-ignore-files "__pycache__")
  (add-to-list 'ido-ignore-files "\.pytest_cache")
  (add-to-list 'ido-ignore-files "\.pkl")
; data files
  (add-to-list 'ido-ignore-files "\.hdf5")
; latex-related
  (add-to-list 'ido-ignore-files "\.nav")
  (add-to-list 'ido-ignore-files "\.out")
  (add-to-list 'ido-ignore-files "\.pdf")
  (add-to-list 'ido-ignore-files "\.snm")
  (add-to-list 'ido-ignore-files "\.synctex.gz")    
  (ido-mode 1)
  )

(use-package ido-vertical-mode
  :ensure t
  :requires ido
  :config
  (ido-vertical-mode 1)
  (setq ido-vertical-define-keys 'C-n-and-C-p-only)
  )

(use-package smex
  :ensure t
  :init (smex-initialize)
  :bind
  ("M-x" . smex))

(global-set-key (kbd "C-x b") 'ido-switch-buffer)

(use-package avy
:ensure t
:bind
("M-s" . avy-goto-char))

;; (use-package sublimity
	;;   :ensure t
	;;   :config
	;;   (sublimity-mode 1))

	;; (use-package sublimity-scroll
	;;   :ensure t
	;;   :config
	;;   (sublimity-mode 1))
;; (require 'sublimity)
;; (require 'sublimity-scroll)
;; (sublimity-mode 1)
      ;; (require 'sublimity-scroll)

(defun activate-virtualenv ()
  "pyenv-activate the current directory + '.venv'
    in the future, the name of virtualenv should be specified as input
    "
  (interactive)
  (message "activating virtualenv")
  (pyvenv-activate
   (expand-file-name
    ".venv" default-directory))
  (setq elpy-rpc-virtualenv-path 'current)  ; set path to Python interpreter correctly
  )

(global-set-key (kbd "C-c a v") 'activate-virtualenv)

(use-package flycheck
  :ensure t)

(use-package ein
  :ensure t
  )

(use-package elpy
  :ensure t
  :config
  (elpy-enable)
  (setq elpy-test-runner 'elpy-test-pytest-runner ; use pytest
	elpy-rpc-backend "jedi"
	;; elpy-rpc-project-specific 't
	elpy-modules (delq 'elpy-module-flymake elpy-modules)
	)
  (add-hook 'elpy-mode-hook 'flycheck-mode)
  )

(use-package cython-mode
  :ensure t)

(use-package tex
      :defer t
      :ensure auctex
      :config
      (setq TeX-auto-save t)
      (setq TeX-save-query nil)
      )

; for MacOS: environment variable fix 
    (setenv "PATH" 
	    (concat
	      "/usr/local/bin/" ":" "/Library/TeX/texbin/" ":"
	      (getenv "PATH")))

; forward/reverse search between PDF and Latex source
(defun my/latex-buffer-setup ()
  (TeX-source-correlate-mode)
  (TeX-PDF-mode))

(add-hook 'LaTeX-mode-hook 'my/latex-buffer-setup)
(setq TeX-source-correlate-method 'synctex
      TeX-view-program-list   ;; Use Skim, it's awesome
      '(("Skim" "/Applications/Skim.app/Contents/SharedSupport/displayline -g -b %n %o %b"))
      TeX-view-program-selection '((output-pdf "Skim"))
      TeX-auto-save t
      TeX-parse-self t
      TeX-save-query nil
      ;; TeX-master 'dwim
      )

(setq-default TeX-master "main") ; all master files called "main".

(when (and (eq system-type 'gnu/linux)
	   (file-exists-p "/home/xiaoh1/code/matlab-emacs-src"))
  (add-to-list 'load-path "/home/xiaoh1/code/matlab-emacs-src")
  (load-library "matlab-load"))

(use-package yaml-mode
:ensure t
:config
(add-to-list 'auto-mode-alist '("\\.yml\\'" . yaml-mode))
)

(use-package yasnippet
  :ensure t
  :config
  (setq yas-snippet-dirs
	'("~/.emacs.d/snippets"
	  "~/.emacs.d/elpa/yasnippet-snippets-20220221.1234/snippets"
	  ))
  ;; "~/.emacs.d/elpa/elpy-20220220.2059/"  ; might need to change
  ;; "~/.emacs.d/elpa/yasnippet-snippets-20220221.1234/snippets"  ; might need to change  
  (yas-global-mode 1)
  )

(use-package yasnippet-snippets
:ensure t
)

(defun config-visit ()
"visit ~/.emacs.d/config.org"
(interactive)
(find-file "~/.emacs.d/config.org"))
(global-set-key (kbd "C-c e") 'config-visit)

(defun config-reload ()
  "Reloads ~/.emacs.d/config.org at runtime"
  (interactive)
  (org-babel-load-file (expand-file-name "~/.emacs.d/config.org")))
(global-set-key (kbd "C-c r") 'config-reload)
