config.org
** open ~/.zshrc file

   #+begin_src emacs-lisp
     (defun zshrc-visit ()
       "visit ~/.zshrc"
       (interactive)
       (find-file "~/.zshrc"))
     (global-set-key (kbd "C-c z") 'zshrc-visit)   

   #+end_src

* terminals


#+BEGIN_SRC emacs-lisp  
  (defvar my-term-shell "/bin/zsh")
  (defadvice ansi-term (before force-bash)
    (interactive (list my-term-shell)))
  (ad-activate 'ansi-term)
  (global-set-key (kbd "C-c a t") 'ansi-term)  ; why does not work? which key is super key?
#+END_SRC

#+RESULTS:
: ansi-term


#+begin_src emacs-lisp
  (global-set-key (kbd "C-c s h") 'shell)  ; why does not work? which key is super key?
#+end_src

   
* miscellenous
** show line/column number

#+begin_src emacs-lisp
(line-number-mode 1)
(column-number-mode 1)
#+end_src
** not sorted yet

#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "M-o")  'mode-line-other-buffer)
  (tool-bar-mode -1)
  (menu-bar-mode -1)
  (when window-system
    (scroll-bar-mode -1))

					
  (setq split-width-threshold 1 )   ; horizontal split window

  (defalias 'yes-or-no-p 'y-or-n-p)



  (setq scroll-conservatively 100)


  (setq inhibit-startup-message t)

  (setq ring-bell-function 'ignore) ; no warning sound

  (when window-system
    (global-hl-line-mode t)
    (global-prettify-symbols-mode t)
    )

  (setq make-backup-files nil)
  (setq auto-save-default nil)


  (show-paren-mode 1)

#+END_SRC

#+RESULTS:
: t

* text maniputation
** line/region copying/deletion

#+begin_src emacs-lisp
(global-set-key (kbd "C-c c l") 'avy-copy-line)  ; copy a line
(global-set-key (kbd "C-c d l") 'avy-kill-whole-line)  ; kill&save a line
(global-set-key (kbd "C-c c r") 'avy-copy-region)  ; copy a region
(global-set-key (kbd "C-c d r") 'avy-kill-region)  ; kill&save a region
#+end_src

#+RESULTS:
: avy-kill-region
** subword

when pressing =M-f= or =M-b= in camel-case strings, e.g., ThisIsAWord, move /subword/.

#+begin_src emacs-lisp
(global-subword-mode 1)
#+end_src

#+RESULTS:

** electric pair mode

#+begin_src emacs-lisp
  (setq electric-pair-pairs '(
			      (?\( . ?\))
			      (?\[ . ?\])
			      (?\{ . ?\})
			      ;; (?\' . ?\')  ; 
			      (?\" . ?\")
			      (?\` . ?\`)
			      ;; (?\$ . ?\$)
  ))
  (electric-pair-mode t)
#+end_src

#+RESULTS:
: t

** kill-whole-word and kill-whole-line

#+begin_src emacs-lisp
  (defun my-kill-whole-word ()
  (interactive)
  (backward-word)
  (kill-word 1)
  )

  (global-set-key (kbd "C-c w w") 'my-kill-whole-word)
#+end_src

#+RESULTS:
: my-kill-whole-word
** TODO copy-whole-word
   
** copy-whole-line

   #+begin_src emacs-lisp
     (defun copy-whole-line ()
       (interactive)
       (save-excursion
	 (kill-new
	  (buffer-substring
	   (point-at-bol)
	   (point-at-eol))))
       )
     (global-set-key (kbd "C-c w l") 'copy-whole-line)
   #+end_src

   #+RESULTS:
   : copy-whole-line

** hungry-delete

#+begin_src emacs-lisp
(use-package hungry-delete
:ensure t
:config (global-hungry-delete-mode))
#+end_src

#+RESULTS:
: t

** delete a pair (of parenthesis, bracket, etc)

#+begin_src emacs-lisp
  (global-set-key (kbd "C-c d p") 'delete-pair)
#+end_src

#+RESULTS:
: delete-pair

* mode line
** spaceline

#+begin_src emacs-lisp
(use-package spaceline
:ensure t
:config
(require 'spaceline-config)
(setq powerline-default-separator (quote arrow))
(spaceline-spacemacs-theme))
#+end_src

** diminish

#+begin_src emacs-lisp
  (use-package diminish
  :ensure t
  :init 
  (diminish 'hungry-delete-mode)
  (diminish 'which-key-mode)
  (diminish 'rainbow-mode)
  (diminish 'beacon-mode)
  (diminish 'subword-mode)
  )
#+End_src

#+RESULTS:

* dmenu

run a command in shell

#+begin_src emacs-lisp
(use-package dmenu
    :ensure t
    :bind
    ("C-c d m" . 'dmenu))
#+end_src

#+RESULTS:
: dmenu
* symon

#+begin_src emacs-lisp

  (use-package symon
    :ensure t
    :bind
    ("C-c s m" . symon-mode))
#+end_src

#+RESULTS:
: t

* searching
  ** text search
  #+begin_src  emacs-lisp
	(use-package swiper
	  :ensure t
	  :bind
	  ("C-s" . swiper))
  #+end_src

  #+RESULTS:
  : swiper



* version control
** magit

   #+begin_src emacs-lisp
     (use-package magit
       :ensure t)
   #+end_src

   #+RESULTS:
