config.el

(defvar my-term-shell "/bin/zsh")
(defadvice ansi-term (before force-bash)
  (interactive (list my-term-shell)))
(ad-activate 'ansi-term)
(global-set-key (kbd "C-c t m") 'ansi-term)  ; why does not work? which key is super key?

(defun zshrc-visit ()
  "visit ~/.zshrc"
  (interactive)
  (find-file "~/.zshrc"))
(global-set-key (kbd "C-c z") 'zshrc-visit)

(line-number-mode 1)
(column-number-mode 1)

(global-set-key (kbd "M-o")  'mode-line-other-buffer)
(tool-bar-mode -1)
(menu-bar-mode -1)
(when window-system
  (scroll-bar-mode -1))


(setq split-width-threshold 1 )   ; horizontal split window

(defalias 'yes-or-no-p 'y-or-n-p)



(setq scroll-conservatively 100)


(setq inhibit-startup-message t)

(setq ring-bell-function 'ignore) ; no warning sound

(when window-system
  (global-hl-line-mode t)
  (global-prettify-symbols-mode t)
  )

(setq make-backup-files nil)
(setq auto-save-default nil)


(show-paren-mode 1)

(global-set-key (kbd "C-c c l") 'avy-copy-line)  ; copy a line
(global-set-key (kbd "C-c d l") 'avy-kill-whole-line)  ; kill&save a line
(global-set-key (kbd "C-c c r") 'avy-copy-region)  ; copy a region
(global-set-key (kbd "C-c d r") 'avy-kill-region)  ; kill&save a region

(global-subword-mode 1)

(setq electric-pair-pairs '(
			    (?\( . ?\))
			    (?\[ . ?\])
			    (?\{ . ?\})
			    ;; (?\' . ?\')  ; 
			    (?\" . ?\")
			    (?\` . ?\`)
			    (?\$ . ?\$)
))
(electric-pair-mode t)

(defun my-kill-whole-word ()
(interactive)
(backward-word)
(kill-word 1)
)

(global-set-key (kbd "C-c w w") 'my-kill-whole-word)

(defun copy-whole-line ()
  (interactive)
  (save-excursion
    (kill-new
     (buffer-substring
      (point-at-bol)
      (point-at-eol))))
  )
(global-set-key (kbd "C-c w l") 'copy-whole-line)

(use-package hungry-delete
:ensure t
:config (global-hungry-delete-mode))

(use-package spaceline
:ensure t
:config
(require 'spaceline-config)
(setq powerline-default-separator (quote arrow))
(spaceline-spacemacs-theme))

(use-package diminish
:ensure t
:init 
(diminish 'hungry-delete-mode)
(diminish 'which-key-mode)
(diminish 'rainbow-mode)
(diminish 'beacon-mode)
(diminish 'subword-mode)
)

(use-package dmenu
    :ensure t
    :bind
    ("C-c d m" . 'dmenu))

(use-package symon
  :ensure t
  :bind
  ("C-c s" . symon-mode))

(use-package swiper
  :ensure t
  :bind
  ("C-s" . swiper))

(use-package magit
  :ensure t)
